{"type": "hash", "key": "mq:snt_has", "value": {"not only": "if not 'but also' in line: r.hset(snt, 'e_pair:not_only:but_also', \"{'cate':'e_pair', 'error':'not only/but also'}\" )\n, = r.hset(snt,'e_punct:comma_space_prefix', \"{'error':'No space before comma'}\")", "but also": "if not 'not only' in line: r.hset(snt, 'e_pair:not_only:but_also', \"{'cate':'e_pair', 'error':'not only/but also'}\" )", ", but": "if '^ although' in line: r.hset(snt, 'e_pair:although:but', \"{'cate':'e_pair', 'error':'although/but'}\" )"}}
{"type": "hash", "key": "cate:stop", "value": {"e_space.extra": "", "e_space.d": ""}}
{"type": "hash", "key": "cate:cn", "value": {"e_in.d_vpn": "{'error':'介词多余','explanation':f'删除{text}'}", "e_DET.s": "{'error':'冠词误用','explanation':f'建议<b>{text}</b>替换为<b>{replaceText}</b>'}", "e_det.d": "{'error':'冠词多余','explanation':f'删除<b>{text}</b>'}", "e_in.s": "{'error':'介词误用','explanation':f'建议<b>{text}</b>替换为<b>{replaceText}</b>'}", "e_noun.nn_nns": "{'error':'名词误用','explanation':f'建议<b>{text}</b>替换为<b>{replaceText}</b>'}", "e_in.i": "{'error':'介词缺失','explanation':f'添加介词{replaceText}'}", "e_IN.d": "{'error':'介词多余','explanation':f'删除{text}'}", "e_IN.d:vpn": "{'error':'介词多余','explanation':f'删除{text}'}", "e_DET.i": "{'error':'冠词缺失','explanation':f'添加冠词<b>{replaceText}</b>'}", "e_DET.d": "{'error':'冠词多余','explanation':f'删除<b>{text}</b>'}", "e_NOUN.NN_NNS": "{'error':'名词误用','explanation':f'建议<b>{text}</b>替换为<b>{replaceText}</b>'}", "e_det.s": "{'error':'冠词误用','explanation':f'建议<b>{text}</b>替换为<b>{replaceText}</b>'}", "e_IN.s": "{'error':'介词误用','explanation':f'建议<b>{text}</b>替换为<b>{replaceText}</b>'}", "e_det.i": "{'error':'冠词缺失','explanation':f'添加冠词<b>{replaceText}</b>'}", "e_IN.i": "{'error':'介词缺失','explanation':f'添加介词{replaceText}'}", "e_in.d": "{'error':'介词多余','explanation':f'删除{text}'}"}}
{"type": "hash", "key": "snt:test", "value": {"what are you staring?": "What are you staring at?", "Some seniority may block junior to stand in after-school activity which may affect the junior's mind of studying.": "Some seniority may block junior to stand in after - school activity which may affect the junior's mind of studying.", "agriculture has been derated a long time.": "Agriculture has been derated for a long time.", "to begin with, administration of the increasing population in urban area might be a great challenge to the government.": "To begin with, the administration of the increasing population in urban areas might be a great challenge for the government.", "i 'm back .": "I' m back.", "So I introducing my winter holiday.": "So I will introduce my winter holiday.", "this meant that my previous plan was delayed, so here is my plan for the next semester.": "This meant that my previous plan was delayed, so here is my plan for the next semester.", "on the contrary, only few of us want to devote their time to helping ordinary people or become scientists.": "On the contrary, only few of us want to devote their time to helping ordinary people or become scientists.", "but his lost youth did not come back him.": "But his lost youth did not come back him.", "the contradiction of the supply of labor force exceeding the demand will exist a very long time to come.": "The contradiction of the supply of labor force exceeding the demand will exist a very long time to come.", "e_prep.wrong.on.for": "e_prep.wrong.on.for", "What's more, college students have make the resources more difficult for them to start their own businesses.": "What's more, college students have make the resources more difficult for them to start their own businesses.", "It is an important medium in modern society, which integrates Internet, communication, entertainment and other functions.": "It is an important medium in modern society, which integrates Internet, communication, entertainment and other functions.", "at present he has become a professor of chemistry at oxford.": "At present he has become a chemistry professor at Oxford.", "it were badly.": "It was bad.", "this time is dissimilar from the past, the stall economy has been no long in a mess": "This time is dissimilar from the past, the stall economy has been no long in a mess", "Ten years ago, I was 11 years old, at a playful age, and sometimes quarreled with my mother.": "Ten years ago, I was 11 years old, at a playful age, and sometimes quarreled with my mother.", "The people who benefit most are those who go from doing absolutely nothing to doing something .": "The people who benefit most are those who go from doing absolutely nothing to doing something.", "I had to as busy as a bee.": "I had to be as busy as a bee.", "we can collect bags of cans and bottles with friends'help,then sell it out in the recycling center.": "We can collect bags of cans and bottles with friends' help, then sell it out in the recycling center.", "to begin with, most college graduates are not enough relative work experience, which is a vital factor for each entrepreneur.[": "To begin with, most college graduates are not enough relative work experience, which is a vital factor for each entrepreneur.", "In the end, the prince leaves the pilot, maybe he returns to his planet living with his rose or whatever else.": "In the end, the prince leaves the pilot, maybe he returns to his planet living with his rose or whatever else.", "Through analysis, we think that Hollywood commercial blockbusters tend to convey some heroism and chivalry feelings, which is every college student's heart yearning for and love.": "Through analysis, we think that Hollywood commercial blockbusters tend to convey some heroism and chivalry feelings, which is every college student's heart yearning for and love.", "english do help us read english original works, but chinese helps us learn a true china.": "English does help us read English original works, but Chinese helps us learn about the true China.", "What's more, the resources that college students have make it more difficult for them to start their own businesses.": "What's more, the resources that college students have make is more difficult for them to start their own businesses.", "currently, the economy of our country is developing rapidly, therefore existing cities is growing bigger and bigger, new cities are emerging.": "Currently, the economy of our country is developing rapidly, therefore existing cities are growing bigger and bigger, new cities are emerging.", "ancient greece was located in the european, whose main features of the terrain was mountainous and hilly.": "Ancient Greece was located in Europe, whose main features of the terrain were mountainous and hilly.", "i 'm badly.": "I' m badly.", "one of the best ways to get started is with recycling": "One of the best ways to get started is by recycling", "there is book which is left by tom.": "There is a book which is left by Tom.", "This article point out the common phenomenon a lack of funds have no choice but to make us become more creative.": "This article points out the common phenomenon a lack of funds has no choice but to make us become more creative.", "Since then, I have felt that life is precious, living is really a kind of happiness": "Since then, I have felt that life is precious, living is really a kind of happiness", "please come back dinner this evening as early as possible.": "Please come back to dinner this evening as early as possible.", "In my impression, you are a fat girl.": "In my impression, you are a fat girl.", "but the fund they raise is limited, which is probably contribute to failing the project in the course of the process.": "But the fund they raise is limited, which is probably contribute to failing the project in the course of the process.", "ted is a region manager.": "Ted is a region manager.", "why should you not have as good food as could be organized when you come back something like this?": "Why should you not have as good food as could be organized when you come back something like this?", "someone knock the doors.": "Someone knocked on the doors.", "So I think students have their own computer in the dormitories is a good option.": "So I think students have their own computer in the dormitories is a good option.", "nothing can disturb you to earn money in the journey to recycle.": "Nothing can disturb you from earning money in the journey to recycle.", "i hope to come back the mode of payment.": "I hope to come back the mode of payment.", "i'm back.": "I'm back.", "This is a conducive choice": "This is a conducive choice", "he felt very tired,for he preached a long time.": "He felt very tired, for he preached a long time.", "you may come back work if you'll behave yourself, she says.": "You may come back to work if you behave yourself, she says.", "her eyes did not seem to have been dry a very long time.": "Her eyes did not seem to have been dry for a very long time.", "however, there were also some scientists suspected that the genius scientist in the eyes of the press had lied.": "However, there were also some scientists suspected that the genius scientist in the eyes of the press had lied.", "as the most successful electronic enterprise in china, alibaba group always motivate its workers with a proverb saying that \"keep your dream alive,because it might come true someday\"": "As the most successful electronic enterprise in China, Alibaba Group always motivates its workers with a proverb saying that \" Keep your dream alive, because it might come true someday \"", "After two particularly big market crises.": "After two particularly big market crises.", "nevertheless, live a low-carbon life in the course of your time in school is a good choice.": "Nevertheless, living a low - carbon life in the course of your time in school is a good choice.", "he was friendly but i think he's one of the spy of alien so i use to keep distent with him until we were 10, the year we start to be close-friend": "He was friendly but I think he's one of the spy of aliens so I used to keep distent with him until we were 10, the year we started to be close - friends", "we are good friend.": "We are good friends.", "her eyes did not seem to have been dry very long time.": "Her eyes did not seem to have dry for a very long time.", "flat words run throughout the whole story, while we could come to realize more truth if we feel it with our heart.": "Flat words run throughout the whole story, while we could come to realize more truth if we feel it with our heart.", "There are also some opportunitys for students find a job in school.": "There are also some opportunitys for students to find a job in school.", "i have to do homework very long time.": "I have to do homework very long time.", "it is ok.": "It is ok.", "i have been waiting very long time.": "I have been waiting a very long time.", "h is badly.": "H is bad.", "on these short video platforms, you can see a large number of videos in line with their interests, so that their after-school life can be enriched.": "On these short video platforms, you can see a large number of videos in line with their interests, so that their after - school life can be enriched.", "come back to our city sometime.": "Come back to our city sometime.", "for another thing, the us has been targeting china , excessively increase the import tax.": "For another thing, the US has been targeting China, excessively increasing the import tax.", "all in all, the urbanization of china is a double-edged sword, while it proving us benefits, it also has side effect.": "All in all, the urbanization of China is a double - edged sword, while it proving us benefits, it also has side effect.", "they integrating a strong team, and decided to stick to the front line, which is both rational and emotional": "They integrate a strong team, and decided to stick to the front line, which is both rational and emotional", "he always can find topic with the guy his talking with.": "He can always find topics to talk about with the guy he is talking about.", "it is the worst a long time.": "It is the worst a long time.", "they use different patterns to attract people's eyes, they even draw up things.": "They use different patterns to attract people's eyes, they even draw up things.", "recycling is one of the best tips,you can draw up a recycle plan in your college life,you can save some money in this recycle process,this way can also protect the environment.": "Recycling is one of the best tips, you can draw up a recycle plan in your college life, you can save some money in this recycle process, this way can also protect the environment.", "So we should pay attention to the problem of robots, it is inevitable to have robots in the future, so we should carefully consider these problems to avoid disasters.[点评][0]": "So we should pay attention to the problem of robots, it is inevitable to have robots in the future, so we should carefully consider these problems to avoid disasters.[<unk>] [0 ]", "i am badly.": "I am bad.", "Sili Alley, an historical alley in the heart of the island, provides the most authentic version.": "Sili Alley, an historical alley in the heart of the island, provides the most authentic version.", "Natural disasters are disasters caused by natural or man-made causes.": "Natural disasters are disasters caused by natural or man - made causes.", "i'm a little worry.": "I'm a little worried.", "come back our city sometime.": "Come back to our city sometime.", "she has ready.": "She is ready.", "i have been waiting a very long time.": "I have been waiting a very long time.", "in the same time, the urbanization of china causes a lot of problems.": "At the same time, urbanization of China causes a lot of problems.", "it is the worst very long time.": "It is the worst very long time.", "there has many skills deserve our efforts.": "There are many skills that deserve our efforts.", "when i was a little boy, i was interest in everything in the world.": "When I was a little boy, I was interested in everything in the world.", "i have sent you the base information about the three candidates.": "I have sent you the base information about the three candidates.", "The crises that hurt the most are the ones you do n't see coming .": "The crises that hurt the most are the ones you don't see coming.", "she is ok.": "She is ok.", "recently,people pay more attention on traveling.": "Recently, people pay more attention to traveling.", "i m badly": "I m badly", "it makes children and teenagers feel unhappiness.": "It makes children and teenagers feel unhappy.", "This happens due to the student is intolerant of adversity.": "This happens due to the student being intolerant of adversity.", "We may seldom see this in urban area, but in countryside, still many people believe that\" a talentless woman is the one with virtue\".": "We may seldom see this in urban areas, but in the countryside, still many people believe that \" a talentless woman is the one with virtue \".", "he has been waiting for his brother a long time.": "He has been waiting for his brother for a long time.", "in addition, this book also contains philosophy available for both children and adults.": "In addition, this book also contains philosophy available for both children and adults.", "mrs. yang would be delighted if you can speak english with the kids for half an hour two or three days a week.": "Mrs. Yang would be delighted if you could speak English with the kids for half an hour two or three days a week.", "her characters are interesting and humous.": "Her characters are interesting and humorous.", "that's the best pizza i've had a long time.": "That's the best pizza I've had for a long time.", "we didn't listen him.": "We didn't listen to him.", "there is no shortcut to the dream, we can do nothing but do our best to make our dream come true.": "There is no shortcut to the dream, we can do nothing but do our best to make our dream come true.", "i'm back .": "I'm back.", "a health body is the key to a health life.": "A health body is the key to a health life.", "What's more, the resources that college students have make more difficult for them to start their own businesses.": "What's more, the resources that college students have make more difficult for them to start their own businesses.", "And strict to your study schedule.": "And strict with your study schedule.", "when you have a health mind, you will love life.": "When you have a healthy mind, you will love life.", "This kind of behavior is understandable but has an influence on to the class order.": "This kind of behavior is understandable but has an influence on the class order.", "getting down to whatever is being crafted suggests that the craftsman must be understanding the product comprehensively.": "Getting down to whatever is being crafted suggests that the craftsman must be understanding the product comprehensively.", "as a student, hard work spirit is more than crucial.": "As a student, hard work spirit is more than crucial.", "he would often stare at the black print a long time.": "He would often stare at the black print for a long time.", "They can have a aid through scholarships and students loans.": "They can have aid through scholarships and students loans.", "recently, due to the fact that something terrible happens to my family, i have to move relocate to another state to take care of my family.": "Recently, due to the fact that something terrible happens to my family, I have to move relocate to another state to take care of my family.", "it is great idea.": "It is a great idea.", "all in all, i think making a plan is more benefit for us.": "All in all, I think making a plan is more beneficial for us.", "i'm badly.": "I'm badly.", "let's check our luggage here and come back it later.": "Let's check our luggage here and come back it later.", "The representative are earthquakes, volcanic eruptions and tsunamis.": "The representative are earthquakes, volcanic eruptions and tsunamis.", "china possessed vast land and numerous plains, so people lived nearly in most areas, and it was easy to form the collective": "China possessed vast land and numerous plains, so people lived nearly in most areas, and it was easy to form the collective", "i agree him.": "I agree with him.", "there is no doubt that study plan is significance.": "There is no doubt that study plan is significant.", "i afmdsafj": "I afmdsafj", "they live on a low-rise apartment building which is within walking distance to our university.": "They live on a low - rise apartment building which is within walking distance to our university.", "I always looking forward to the winter vacation.": "I am always looking forward to the winter vacation.", "he are good.": "He is good.", "At the first time I took my oral class, he told to us not to use the cell phone in class because he did not want to spend much time keeping the class order.": "The first time I took my oral class, he told us not to use the cell phone in class because he did not want to spend much time keeping the class order.", "The second point is to consider various factors and try to make the most suitable choice that will not make regret.": "The second point is to consider various factors and try to make the most suitable choice that will not make regret.", "someone knocked the door.": "Someone knocked on the door.", "he is staring me.": "He is staring at me.", "let's check our luggage here and come back for it later.": "Let's check our luggage here and come back later.", "Maybe these were too far away for you ten years ago.": "Maybe these were too far away for you ten years ago.", "At that time, the person I liked the most is Melanie Hamilton.": "At that time, the person I liked the most was Melanie Hamilton.", "The people who benefit the most are those who go from doing absolutely nothing to doing something .": "The people who benefit the most are those who go from doing absolutely nothing to doing something.", "biology, chemistry,and physics are sciences.": "Biology, chemistry, and physics are sciences.", "she seem weakness.": "She seems weak.", "however, the dormitory life is not always harmony or peaceful.": "However, dormitory life is not always harmonious or peaceful.", "but in my opinion, it's more harm than good.": "But in my opinion, it's more harm than good.", "there's a microwave, a toaster, a coffee maker as well as a dishwasher in the kitchen.": "There's a microwave, a toaster, a coffee maker as well as a dishwasher in the kitchen.", "i 'm back.": "I' m back.", "crafts encompass stories of pursuing perfection with passion, and pass them for generations to come.": "Crafts encompass stories of pursuing perfection with passion, and pass them for generations to come.", "It is cheaper then new things just need a little searching.": "It is cheaper then new things just need a little searching.", "Mobile phones are easy to disrupt the order of classroom teaching, cheating in examinations and radiation to people.": "Mobile phones are easy to disrupt the order of classroom teaching, cheating in examinations and radiation to people.", "But in the school, there is a library which can have more than one thousand people study there.": "But in the school, there is a library which can have more than one thousand people study there.", "there is book is left by tom.": "There is a book left by Tom.", "he's come back to the village to see us folks.": "He's come back to the village to see us folks.", "she cherished the hope that he would come back her some day.": "She cherished the hope that he would come back her some day.", "there has many book.": "There were many books.", "They feel extremely exhausted when a busy day end.": "They feel extremely exhausted when a busy day ends.", "and ted , who is a region manager.": "And Ted, who is a region manager.", "this are gramamtical sentence .": "This is a grammatical sentence.", "while in the west,people often just answer their names under this circumstances.": "While in the West, people often just answer their names under these circumstances.", "With buildings collapsing and relative losing,a sudden earthquake break the peace existing in the country before.": "With buildings collapsing and relative losing, a sudden earthquake broke the peace existing in the country before.", "As consumer demand starts to upgrade at the same time of product upgrading and eventually surpasses, this becomes the goal that all companies need to pursue wholeheartedly.": "As consumer demand starts to upgrade at the same time as product upgrading and eventually surpasses, this becomes the goal that all companies need to pursue wholeheartedly.", "the contradiction of the supply of labor force exceeding the demand will exist very long time to come.": "The contradiction of the supply of labor force exceeding the demand will exist very long time to come.", "compared with the uk, the main pre-school stage in the uk is the period when the child is 3-4 years old.": "Compared with the UK, the main pre - school stage in the UK is the period when the child is 3 - 4 years old.", "Hello, ten years had passed.": "Hello, ten years have passed.", "however, i think it is more negative effects than positive effects for college students to scrub short videos.": "However, I think it has more negative effects than positive effects for college students to scrub short videos.", "in a turbid and floating society, i can always keep my heart": "In a turbid and floating society, I can always keep my heart", "All we can do is predict in advance when an earthquake is likely to come and be prepared to escape in advance.": "All we can do is predict in advance when an earthquake is likely to come and be prepared to escape in advance.", "some of my classmates loan money from huabei in order to buy the same cosmetics as used by their ideal on tiktok every month.": "Some of my classmates loan money from Huabei in order to buy the same cosmetics as used by their ideal on Tiktok every month.", "it is high time for us to find out our vitals to make us success.": "It is high time for us to find out our vitals to make us successful.", "when i hear of your news, i take pride in you and acknowledge that you achieve yourself by your hard-working and persistance.": "When I hear of your news, I take pride in you and acknowledge that you achieve yourself by your hard - working and persistance.", "This study presents estimates of great help to college student's Budget.": "This study presents estimates of great help to college student's Budget.", "In material terms, many people have been satisfied, but in spirit, what the Chinese have gained is far from enough.": "In material terms, many people have been satisfied, but in spirit, what the Chinese have gained is far from enough.", "i went traveling many times, but still remember my first time travel to shenzhen city.": "I went traveling many times, but still remember my first time traveling to Shenzhen city.", "At the same time, the process of economic globalization has been accelerated, and more attention has been paid to the immediate demand for information.": "At the same time, the process of economic globalization has accelerated, and more attention has been paid to the immediate demand for information.", "the contradiction of the supply of labor force exceeding the demand will exist for a very long time to come.": "The contradiction of the supply of labor force exceeding the demand will exist for a very long time to come.", "what comes first in our minds when we are talking about perfection are always the spirit and persistence of those who craft.": "What comes first in our minds when we are talking about perfection is always the spirit and persistence of those who craft.", "although short video can meet the spiritual needs of college students in the new era, there are also some people who are too addicted to it and some even affect their normal life.": "Although short videos can meet the spiritual needs of college students in the new era, there are also some people who are too addicted to it and some even affect their normal life.", "But this way is less environmentally.": "But this way is less environmentally friendly.", "i hope you could wait me.": "I hope you could wait for me.", "i m badly.": "I m badly.", "i will show the different values and ways of thinking between china and the west, one of which is the difference between collectivism and individualism.": "I will show the different values and ways of thinking between China and the West, one of which is the difference between collectivism and individualism.", "sometimes, strangers maybe start their communication with asking each other \"what's your company?\"": "Sometimes, strangers may start their communication by asking each other \" What's your company? \"", "they are roommate.": "They are roommates.", "what are you waiting?": "What are you waiting for?", "What I enjoyed the most was that it was not a friendly game.": "What I enjoyed the most was that it was not a friendly game.", "her darling boy was to come back her repentant and tender-hearted.": "Her darling boy came back her repentant and tender - hearted.", "Contemporary college students have mount number of ways to spend money and it is becoming increasing number of price.": "Contemporary college students have mount of ways to spend money and it is becoming an increasing number of price.", "When students are listening attentively, the sudden appearance of mobile phone ring will let them out of the state of concentration.": "When students are listening attentively, the sudden appearance of mobile phone ring will let them out of the state of concentration.", "as requested, we are pleasure to offer you that the total price is $177.98.": "As requested, we are pleased to offer you that the total price is $177.98.", "Times slowly passed the last step came, the cake should be put into the oven.": "Time slowly passed the last step, and the cake should be put into the oven.", "The network can provide something faster than we have in mind.": "The network can provide something faster than we have in mind.", "This part of the book reveals the perplexing and complex world in adults' eyes, which makes the whole story associated with reality and more persuasive to today's people.": "This part of the book reveals the perplexing and complex world in adults' eyes, which makes the whole story associated with reality and more persuasive to today's people.", "for example,we can chat with firends who are lived in the other city by using app like qq or wechat,and it takes us just a few seconds to get connect with them.": "For example, we can chat with friends who are living in another city by using APP like QQ or WeChat, and it takes us just a few seconds to get in touch with them.", "he's come back the village to see us folks.": "He's come back to the village to see us folks.", "he felt very tired,for he preached for a long time.": "He felt very tired, for he preached for a long time.", "In appearance, I am better than before.": "In appearance, I am better than before.", "you'd better come back earth now and finish your homework.": "You'd better come back earth now and finish your homework.", "In the past few months , you left your family and friends and go to various hospitals to fight with COVID-19.": "In the past few months, you left your family and friends and go to various hospitals to fight with COVID-19.", "It will reduce their vision obviously in a short year.": "It will obviously reduce their vision in a short year."}}
{"type": "hash", "key": "stop:np", "value": {"many book": "1"}}
{"type": "hash", "key": "errant:type", "value": {"M:DET": "{ 'error': '冠词缺失', 'explanation':f'建议添加冠词<b>{edit.c_str}</b>'}", "M:NOUN:POSS": "{ 'error': '名词所有格缺失', 'explanation':f'建议添加名词所有格<b>{edit.c_str}</b>'}", "R:VERB:SVA": "{ 'error': '主谓不一致', 'explanation':f'请检查动词<b>{edit.o_str}</b>形态'}", "UNK": "{ 'error': '未知错误', 'explanation':f'检测到但未修正错误'}", "R:ADJ:FORM": "{ 'error': '形容词形式错误', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "M:VERB:TENSE": "{ 'error': '动词时态缺失', 'explanation':f'建议添加动词时态<b>{edit.c_str}</b>'}", "R:DET": "{ 'error': '冠词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:NOUN": "{ 'error': '名词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "U:NOUN": "{ 'error': '名词多余', 'explanation':f'名词<b>{edit.o_str}</b>疑似多余'}", "R:NOUN:INFL": "{ 'error': '名词词形变化错误', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:ORTH": "{ 'error': '大小写/或空格错误', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "M:CONJ": "{ 'error': '连词缺失', 'explanation':f'建议添加连词<b>{edit.c_str}</b>'}", "U:ADV": "{ 'error': '副词多余', 'explanation':f'副词<b>{edit.o_str}</b>疑似多余'}", "U:PREP": "{ 'error': '介词多余', 'explanation':f'介词<b>{edit.o_str}</b>疑似多余'}", "M:VERB": "{ 'error': '动词缺失', 'explanation':f'建议添加动词<b>{edit.c_str}</b>'}", "U:PART": "{ 'error': '与动词构成短语动词的副词或介词多余', 'explanation':f'与动词构成短语动词的副词或介词<b>{edit.o_str}</b>疑似多余'}", "R:OTHER": "{ 'error': '单词误用', 'explanation':f'建议修改为<b>{edit.c_str}</b>'}", "R:PREP": "{ 'error': '介词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:VERB:INFL": "{ 'error': '动词词形变化错误', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:CONJ": "{ 'error': '连词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:SPELL": "{ 'error': '拼写错误', 'explanation':f'请检查<b>{edit.o_str}</b>拼写'}", "R:MORPH": "{ 'error': '词性误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:VERB:FORM": "{ 'error': '动词形式误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "U:ADJ": "{ 'error': '形容词多余', 'explanation':f'形容词<b>{edit.o_str}</b>疑似多余'}", "M:PART": "{ 'error': '与动词构成短语动词的副词或介词缺失', 'explanation':f'建议添加与动词构成短语动词的副词或介词<b>{edit.c_str}</b>'}", "M:PUNCT": "{ 'error': '标点符号缺失', 'explanation':f'建议添加标点符号<b>{edit.c_str}</b>'}", "R:ADV": "{ 'error': '副词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "M:PREP": "{ 'error': '介词缺失', 'explanation':f'建议添加介词<b>{edit.c_str}</b>'}", "R:PRON": "{ 'error': '代词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:ADJ": "{ 'error': '形容词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "M:CONTR": "{ 'error': '缩略形式缺失', 'explanation':f'建议添加缩略形式<b>{edit.c_str}</b>'}", "U:VERB:TENSE": "{ 'error': '动词时态多余', 'explanation':f'动词时态<b>{edit.o_str}</b>疑似多余'}", "R:NOUN:POSS": "{ 'error': '名词所有格误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:VERB:TENSE": "{ 'error': '动词时态误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "U:VERB:FORM": "{ 'error': '动词形式多余', 'explanation':f'动词形式<b>{edit.o_str}</b>疑似多余'}", "U:PUNCT": "{ 'error': '标点符号多余', 'explanation':f'标点符号<b>{edit.o_str}</b>疑似多余'}", "R:NOUN:NUM": "{ 'error': '名词单复数错误', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:VERB": "{ 'error': '动词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "M:PRON": "{ 'error': '代词缺失', 'explanation':f'建议添加代词<b>{edit.c_str}</b>'}", "M:NOUN": "{ 'error': '名词缺失', 'explanation':f'建议添加名词<b>{edit.c_str}</b>'}", "U:CONJ": "{ 'error': '连词多余', 'explanation':f'连词<b>{edit.o_str}</b>疑似多余'}", "M:ADV": "{ 'error': '副词缺失', 'explanation':f'建议添加副词<b>{edit.c_str}</b>'}", "R:PUNCT": "{ 'error': '标点符号误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "R:CONTR": "{ 'error': '缩略形式错误', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "M:VERB:FORM": "{ 'error': '动词形式缺失', 'explanation':f'建议添加动词形式<b>{edit.c_str}</b>'}", "U:DET": "{ 'error': '冠词多余', 'explanation':f'冠词<b>{edit.o_str}</b>疑似多余'}", "M:ADJ": "{ 'error': '形容词缺失', 'explanation':f'建议添加形容词<b>{edit.c_str}</b>'}", "U:CONTR": "{ 'error': '缩略形式多余', 'explanation':f'缩略形式<b>{edit.o_str}</b>疑似多余'}", "U:VERB": "{ 'error': '动词多余', 'explanation':f'动词<b>{edit.o_str}</b>疑似多余'}", "U:NOUN:POSS": "{ 'error': '名词所有格多余', 'explanation':f'名词所有格<b>{edit.o_str}</b>疑似多余'}", "R:WO": "{ 'error': '语序错误', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "U:PRON": "{ 'error': '代词多余', 'explanation':f'代词<b>{edit.o_str}</b>疑似多余'}", "R:PART": "{ 'error': '与动词构成短语动词的副词或介词误用', 'explanation':f'建议<b>{edit.o_str}</b>修改为<b>{edit.c_str}</b>'}", "U:SPACE": "{ 'error': '空格多余', 'explanation':f'建议删除空格'}", "U:OTHER": "{ 'error': '单词冗余', 'explanation':f'建议删除<b>{edit.o_str} </b>'}", "M:OTHER": "{ 'error': '单词缺失', 'explanation':f'建议添加<b>{edit.c_str}</b>'}"}}
{"type": "hash", "key": "trie:gec", "value": {"+ have - VERB + VERB": "{'cate':f'e_verb.tense', 'op':'s','ibeg':arr[i+3].i, 'text':arr[i+3].text, 'replaceText':f'{arr[i+1].text} {arr[i+5].text}'}", "* - * + %": "{'cate':f'e_{arr[i+2].pos_}.s', 'op':'s','ibeg':arr[i+2].i, 'text':arr[i+2].text, 'replaceText':arr[i+4].text}", "* * + % *": "{'cate':f'e_word.miss','op':'i','ibeg':arr[i+4].i,'text':'','replaceText':arr[i+3].text}", "- * - * + % + %": "{'cate':'e_word', 'op':'s','ibeg':{arr[i+1].i, 'text':f'{arr[i+1].text} {arr[i+3].text}', 'replaceText':f'{arr[i+5].text} {arr[i+7].text}'}", "- have + be": "{'cate':'e_verb.have', 'op':'s','ibeg':arr[i+1].i,'text':arr[i+1].text, 'replaceText':arr[i+3].text}", "PRON - VBP + VBZ": "{'cate':'e_snt.nv_agree', 'op':'s','ibeg':arr[i+2].i, 'text':arr[i+2].text, 'replaceText':arr[i+4].text}", "^ + %": "{'op':'i','ibeg':0, 'text':arr[i+2].text}", "PRON - VBZ + VBP": "{'cate':'e_snt.nv_agree', 'op':'s','ibeg':arr[i+2].i, 'text':arr[i+2].text, 'replaceText':arr[i+4].text}", "- * + %": "{'cate':'e_word', 'op':'s','ibeg':arr[i+1].i, 'text':arr[i+1].text, 'replaceText':arr[i+3].text}", "ADJ - NN + NNS *": "{'cate':'e_NOUN.NN_NNS', 'op':'s', 'ibeg':arr[i+2].i, 'text':arr[i+2].text, 'replaceText':arr[i+4].text}", "- * + % + %": "{'cate':'e_word','op':'s','ibeg':arr[i+1].i, 'text':arr[i+1].text, 'replaceText':f'{arr[i+3].text} {arr[i+5].text}'}", "there - have + be": "{'cate':'e_verb.there', 'op':'s', 'ibeg':f'{arr[i+2].i}',  'text':f'{arr[i+2].text}', 'replaceText':f'{arr[i+4].text}', 'explanation':'<b>there be</b>句型用法错误'}", "^ + % + %": "{'op':'i','ibeg':0, 'text':f'{arr[i+2].text} {arr[i+4].text}'}", "- a/an + the": "{'cate':'e_DET.s', 'op':'s', 'ibeg':arr[i+1].i,'text':arr[i+1].text, 'replaceText':arr[i+3].text}", "+ a/an NN/JJ": "{'cate':'e_DET.i', 'op':'i', 'ibeg':arr[i+2].i, 'replaceText':arr[i+1].text}", "* + % - * *": "{'cate':'e_word.miss','op':'i','ibeg':arr[i+4].i, 'text':arr[i+2].text}", "* + % $": "{'cate':f'e_{arr[i+2].pos_}.miss','op':'i','ibeg':arr[i].i,'position':f'{arr[i].idx + len(arr[i].text) + 1}', 'text':arr[i+2].text}", "NOUN + _mark VERB": "{'cate':'e_word.miss', 'op':'i', 'ibeg':{arr[i+3].i, 'replaceText':arr[i+2].text}", "- *": "{'cate':f'e_{arr[i+1].pos_}.extra', 'op':'d','ibeg':arr[i+1].i,  'text':arr[i+1].text, 'replaceText':''}", "VERB - IN *": "{'cate':'e_IN.d:vpn', 'op':'d', 'ibeg':arr[i+2].i, 'text':arr[i+2].text}"}}
